In [ ]:
# ref: https://www.dataquest.io/blog/jupyter-notebook-tutorial/

In [4]:
print('Hello World!')

Hello World!

In [6]:
import time
time.sleep(3)

In [7]:
def say_hello(recipient):
    return 'Hello, {}!'.format(recipient)

say_hello('Tim')

'Hello, Tim!'

In [9]:
import numpy as np
def square(x):
    return x * x

In [10]:
x = np.random.randint(1, 10)
y = square(x)
print('%d squared is %d' % (x, y))

2 squared is 4

In [14]:
%matplotlib inline
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
sns.set(style="darkgrid")

In [17]:
df = pd.read_csv('fortune500.csv')

In [18]:
df.head()

   rank           company  revenue ($ millions) profit ($ millions)
0     1    General Motors              189058.0              6002.0
1     2   Wal-Mart Stores              166809.0              5377.0
2     3       Exxon Mobil              163881.0              7910.0
3     4        Ford Motor              162558.0              7237.0
4     5  General Electric              111630.0             10717.0

In [19]:
df.tail()

     rank                   company  revenue ($ millions) profit ($ millions)
495   496  Consolidated Natural Gas                3074.3               136.8
496   497              Budget Group                3072.5               -64.5
497   498                    Tesoro                3065.7                75.0
498   499            TransMontaigne                3047.1                 1.9
499   500       ReliaStar Financial                3037.3               253.6